set_property IOSTANDARD LVCMOS18 [get_ports *]

create_clock -period 60.000 -name clk -waveform {0.000 30.000} [get_ports clk]
create_generated_clock -name nreset_sync -source [get_ports clk] -divide_by 1 [get_pins nreset_sync_reg/Q]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {data_memory_in_v[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {data_memory_in_v[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {instruction_memory_v[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {instruction_memory_v[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports nreset]
set_input_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports nreset]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {data_memory_a[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {data_memory_a[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {data_memory_out_v[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {data_memory_out_v[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {data_memory_s[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {data_memory_s[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {error_indicator[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {error_indicator[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {instruction_memory_a[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports {instruction_memory_a[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports data_memory_read]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports data_memory_read]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports data_memory_write]
set_output_delay -clock [get_clocks clk] -max -add_delay 2.000 [get_ports data_memory_write]

